{
  "transform_params" : {
    "image" : {
      "bias_a" : 0,
      "bias_g" : 0,
      "bias_r" : 0,
      "bias_b" : 0,
      "center_mean" : 0,
      "is_network_bgr" : 0,
      "scale" : 0.0039215688593685627
    }
  },
  "properties" : {

  },
  "analyses" : {

  },
  "format_version" : 200,
  "storage" : "model.espresso.weights",
  "layers" : [
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "mobilenetv2_1.00_224_Conv1",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 0,
      "top" : "mobilenetv2_1.00_224_Conv1_relu_output_relu",
      "blob_weights" : 3,
      "K" : 3,
      "blob_biases" : 1,
      "stride_x" : 2,
      "name" : "mobilenetv2_1.00_224_Conv1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "image",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "mobilenetv2_1.00_224_Conv1_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "mobilenetv2_1.00_224_Conv1_relu__neg__",
      "top" : "mobilenetv2_1.00_224_Conv1_relu_output_relu_neg",
      "type" : "activation",
      "name" : "mobilenetv2_1.00_224_Conv1_relu__neg__",
      "beta" : 0
    },
    {
      "bottom" : "mobilenetv2_1.00_224_Conv1_relu_output_relu_neg",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "mobilenetv2_1.00_224_Conv1_relu__clip__",
      "top" : "mobilenetv2_1.00_224_Conv1_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "mobilenetv2_1.00_224_Conv1_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "mobilenetv2_1.00_224_Conv1_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "mobilenetv2_1.00_224_Conv1_relu_neg2",
      "top" : "mobilenetv2_1.00_224_Conv1_relu_output",
      "type" : "activation",
      "name" : "mobilenetv2_1.00_224_Conv1_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "mobilenetv2_1.00_224_expanded_conv_depthwise",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "mobilenetv2_1.00_224_expanded_conv_depthwise_relu_output_relu",
      "blob_weights" : 7,
      "K" : 32,
      "blob_biases" : 5,
      "name" : "mobilenetv2_1.00_224_expanded_conv_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 32,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "mobilenetv2_1.00_224_Conv1_relu_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "mobilenetv2_1.00_224_expanded_conv_depthwise_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "mobilenetv2_1.00_224_expanded_conv_depthwise_relu__neg__",
      "top" : "mobilenetv2_1.00_224_expanded_conv_depthwise_relu_output_relu_neg",
      "type" : "activation",
      "name" : "mobilenetv2_1.00_224_expanded_conv_depthwise_relu__neg__",
      "beta" : 0
    },
    {
      "bottom" : "mobilenetv2_1.00_224_expanded_conv_depthwise_relu_output_relu_neg",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "mobilenetv2_1.00_224_expanded_conv_depthwise_relu__clip__",
      "top" : "mobilenetv2_1.00_224_expanded_conv_depthwise_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "mobilenetv2_1.00_224_expanded_conv_depthwise_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "mobilenetv2_1.00_224_expanded_conv_depthwise_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "mobilenetv2_1.00_224_expanded_conv_depthwise_relu_neg2",
      "top" : "mobilenetv2_1.00_224_expanded_conv_depthwise_relu_output",
      "type" : "activation",
      "name" : "mobilenetv2_1.00_224_expanded_conv_depthwise_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "mobilenetv2_1.00_224_expanded_conv_project",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "mobilenetv2_1.00_224_expanded_conv_project_BN_output",
      "blob_weights" : 11,
      "K" : 32,
      "blob_biases" : 9,
      "name" : "mobilenetv2_1.00_224_expanded_conv_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "mobilenetv2_1.00_224_expanded_conv_depthwise_relu_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "mobilenetv2_1.00_224_block_1_expand",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "mobilenetv2_1.00_224_block_1_expand_relu_output_relu",
      "blob_weights" : 15,
      "K" : 16,
      "blob_biases" : 13,
      "name" : "mobilenetv2_1.00_224_block_1_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 96,
      "bottom" : "mobilenetv2_1.00_224_expanded_conv_project_BN_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "mobilenetv2_1.00_224_block_1_expand_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "mobilenetv2_1.00_224_block_1_expand_relu__neg__",
      "top" : "mobilenetv2_1.00_224_block_1_expand_relu_output_relu_neg",
      "type" : "activation",
      "name" : "mobilenetv2_1.00_224_block_1_expand_relu__neg__",
      "beta" : 0
    },
    {
      "bottom" : "mobilenetv2_1.00_224_block_1_expand_relu_output_relu_neg",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "mobilenetv2_1.00_224_block_1_expand_relu__clip__",
      "top" : "mobilenetv2_1.00_224_block_1_expand_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "mobilenetv2_1.00_224_block_1_expand_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "mobilenetv2_1.00_224_block_1_expand_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "mobilenetv2_1.00_224_block_1_expand_relu_neg2",
      "top" : "mobilenetv2_1.00_224_block_1_expand_relu_output",
      "type" : "activation",
      "name" : "mobilenetv2_1.00_224_block_1_expand_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "mobilenetv2_1.00_224_block_1_depthwise",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 0,
      "top" : "mobilenetv2_1.00_224_block_1_depthwise_relu_output_relu",
      "blob_weights" : 19,
      "K" : 96,
      "blob_biases" : 17,
      "stride_x" : 2,
      "name" : "mobilenetv2_1.00_224_block_1_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 96,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 96,
      "bottom" : "mobilenetv2_1.00_224_block_1_expand_relu_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "mobilenetv2_1.00_224_block_1_depthwise_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "mobilenetv2_1.00_224_block_1_depthwise_relu__neg__",
      "top" : "mobilenetv2_1.00_224_block_1_depthwise_relu_output_relu_neg",
      "type" : "activation",
      "name" : "mobilenetv2_1.00_224_block_1_depthwise_relu__neg__",
      "beta" : 0
    },
    {
      "bottom" : "mobilenetv2_1.00_224_block_1_depthwise_relu_output_relu_neg",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "mobilenetv2_1.00_224_block_1_depthwise_relu__clip__",
      "top" : "mobilenetv2_1.00_224_block_1_depthwise_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "mobilenetv2_1.00_224_block_1_depthwise_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "mobilenetv2_1.00_224_block_1_depthwise_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "mobilenetv2_1.00_224_block_1_depthwise_relu_neg2",
      "top" : "mobilenetv2_1.00_224_block_1_depthwise_relu_output",
      "type" : "activation",
      "name" : "mobilenetv2_1.00_224_block_1_depthwise_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "mobilenetv2_1.00_224_block_1_project",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "mobilenetv2_1.00_224_block_1_project_BN_output",
      "blob_weights" : 23,
      "K" : 96,
      "blob_biases" : 21,
      "name" : "mobilenetv2_1.00_224_block_1_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 24,
      "bottom" : "mobilenetv2_1.00_224_block_1_depthwise_relu_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "mobilenetv2_1.00_224_block_2_expand",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "mobilenetv2_1.00_224_block_2_expand_relu_output_relu",
      "blob_weights" : 27,
      "K" : 24,
      "blob_biases" : 25,
      "name" : "mobilenetv2_1.00_224_block_2_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "mobilenetv2_1.00_224_block_1_project_BN_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "mobilenetv2_1.00_224_block_2_expand_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "mobilenetv2_1.00_224_block_2_expand_relu__neg__",
      "top" : "mobilenetv2_1.00_224_block_2_expand_relu_output_relu_neg",
      "type" : "activation",
      "name" : "mobilenetv2_1.00_224_block_2_expand_relu__neg__",
      "beta" : 0
    },
    {
      "bottom" : "mobilenetv2_1.00_224_block_2_expand_relu_output_relu_neg",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "mobilenetv2_1.00_224_block_2_expand_relu__clip__",
      "top" : "mobilenetv2_1.00_224_block_2_expand_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "mobilenetv2_1.00_224_block_2_expand_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "mobilenetv2_1.00_224_block_2_expand_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "mobilenetv2_1.00_224_block_2_expand_relu_neg2",
      "top" : "mobilenetv2_1.00_224_block_2_expand_relu_output",
      "type" : "activation",
      "name" : "mobilenetv2_1.00_224_block_2_expand_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "mobilenetv2_1.00_224_block_2_depthwise",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "mobilenetv2_1.00_224_block_2_depthwise_relu_output_relu",
      "blob_weights" : 31,
      "K" : 144,
      "blob_biases" : 29,
      "name" : "mobilenetv2_1.00_224_block_2_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 144,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "mobilenetv2_1.00_224_block_2_expand_relu_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "mobilenetv2_1.00_224_block_2_depthwise_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "mobilenetv2_1.00_224_block_2_depthwise_relu__neg__",
      "top" : "mobilenetv2_1.00_224_block_2_depthwise_relu_output_relu_neg",
      "type" : "activation",
      "name" : "mobilenetv2_1.00_224_block_2_depthwise_relu__neg__",
      "beta" : 0
    },
    {
      "bottom" : "mobilenetv2_1.00_224_block_2_depthwise_relu_output_relu_neg",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "mobilenetv2_1.00_224_block_2_depthwise_relu__clip__",
      "top" : "mobilenetv2_1.00_224_block_2_depthwise_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "mobilenetv2_1.00_224_block_2_depthwise_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "mobilenetv2_1.00_224_block_2_depthwise_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "mobilenetv2_1.00_224_block_2_depthwise_relu_neg2",
      "top" : "mobilenetv2_1.00_224_block_2_depthwise_relu_output",
      "type" : "activation",
      "name" : "mobilenetv2_1.00_224_block_2_depthwise_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "mobilenetv2_1.00_224_block_2_project",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "mobilenetv2_1.00_224_block_2_project_BN_output",
      "blob_weights" : 35,
      "K" : 144,
      "blob_biases" : 33,
      "name" : "mobilenetv2_1.00_224_block_2_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 24,
      "bottom" : "mobilenetv2_1.00_224_block_2_depthwise_relu_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "mobilenetv2_1.00_224_block_1_project_BN_output,mobilenetv2_1.00_224_block_2_project_BN_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "mobilenetv2_1.00_224_block_2_add",
      "top" : "mobilenetv2_1.00_224_block_2_add_output",
      "type" : "elementwise",
      "name" : "mobilenetv2_1.00_224_block_2_add",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "mobilenetv2_1.00_224_block_3_expand",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "mobilenetv2_1.00_224_block_3_expand_relu_output_relu",
      "blob_weights" : 39,
      "K" : 24,
      "blob_biases" : 37,
      "name" : "mobilenetv2_1.00_224_block_3_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "mobilenetv2_1.00_224_block_2_add_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "mobilenetv2_1.00_224_block_3_expand_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "mobilenetv2_1.00_224_block_3_expand_relu__neg__",
      "top" : "mobilenetv2_1.00_224_block_3_expand_relu_output_relu_neg",
      "type" : "activation",
      "name" : "mobilenetv2_1.00_224_block_3_expand_relu__neg__",
      "beta" : 0
    },
    {
      "bottom" : "mobilenetv2_1.00_224_block_3_expand_relu_output_relu_neg",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "mobilenetv2_1.00_224_block_3_expand_relu__clip__",
      "top" : "mobilenetv2_1.00_224_block_3_expand_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "mobilenetv2_1.00_224_block_3_expand_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "mobilenetv2_1.00_224_block_3_expand_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "mobilenetv2_1.00_224_block_3_expand_relu_neg2",
      "top" : "mobilenetv2_1.00_224_block_3_expand_relu_output",
      "type" : "activation",
      "name" : "mobilenetv2_1.00_224_block_3_expand_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "mobilenetv2_1.00_224_block_3_depthwise",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 0,
      "top" : "mobilenetv2_1.00_224_block_3_depthwise_relu_output_relu",
      "blob_weights" : 43,
      "K" : 144,
      "blob_biases" : 41,
      "stride_x" : 2,
      "name" : "mobilenetv2_1.00_224_block_3_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 144,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "mobilenetv2_1.00_224_block_3_expand_relu_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "mobilenetv2_1.00_224_block_3_depthwise_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "mobilenetv2_1.00_224_block_3_depthwise_relu__neg__",
      "top" : "mobilenetv2_1.00_224_block_3_depthwise_relu_output_relu_neg",
      "type" : "activation",
      "name" : "mobilenetv2_1.00_224_block_3_depthwise_relu__neg__",
      "beta" : 0
    },
    {
      "bottom" : "mobilenetv2_1.00_224_block_3_depthwise_relu_output_relu_neg",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "mobilenetv2_1.00_224_block_3_depthwise_relu__clip__",
      "top" : "mobilenetv2_1.00_224_block_3_depthwise_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "mobilenetv2_1.00_224_block_3_depthwise_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "mobilenetv2_1.00_224_block_3_depthwise_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "mobilenetv2_1.00_224_block_3_depthwise_relu_neg2",
      "top" : "mobilenetv2_1.00_224_block_3_depthwise_relu_output",
      "type" : "activation",
      "name" : "mobilenetv2_1.00_224_block_3_depthwise_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "mobilenetv2_1.00_224_block_3_project",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "mobilenetv2_1.00_224_block_3_project_BN_output",
      "blob_weights" : 47,
      "K" : 144,
      "blob_biases" : 45,
      "name" : "mobilenetv2_1.00_224_block_3_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "mobilenetv2_1.00_224_block_3_depthwise_relu_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "mobilenetv2_1.00_224_block_4_expand",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "mobilenetv2_1.00_224_block_4_expand_relu_output_relu",
      "blob_weights" : 51,
      "K" : 32,
      "blob_biases" : 49,
      "name" : "mobilenetv2_1.00_224_block_4_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "mobilenetv2_1.00_224_block_3_project_BN_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "mobilenetv2_1.00_224_block_4_expand_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "mobilenetv2_1.00_224_block_4_expand_relu__neg__",
      "top" : "mobilenetv2_1.00_224_block_4_expand_relu_output_relu_neg",
      "type" : "activation",
      "name" : "mobilenetv2_1.00_224_block_4_expand_relu__neg__",
      "beta" : 0
    },
    {
      "bottom" : "mobilenetv2_1.00_224_block_4_expand_relu_output_relu_neg",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "mobilenetv2_1.00_224_block_4_expand_relu__clip__",
      "top" : "mobilenetv2_1.00_224_block_4_expand_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "mobilenetv2_1.00_224_block_4_expand_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "mobilenetv2_1.00_224_block_4_expand_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "mobilenetv2_1.00_224_block_4_expand_relu_neg2",
      "top" : "mobilenetv2_1.00_224_block_4_expand_relu_output",
      "type" : "activation",
      "name" : "mobilenetv2_1.00_224_block_4_expand_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "mobilenetv2_1.00_224_block_4_depthwise",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "mobilenetv2_1.00_224_block_4_depthwise_relu_output_relu",
      "blob_weights" : 55,
      "K" : 192,
      "blob_biases" : 53,
      "name" : "mobilenetv2_1.00_224_block_4_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 192,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "mobilenetv2_1.00_224_block_4_expand_relu_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "mobilenetv2_1.00_224_block_4_depthwise_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "mobilenetv2_1.00_224_block_4_depthwise_relu__neg__",
      "top" : "mobilenetv2_1.00_224_block_4_depthwise_relu_output_relu_neg",
      "type" : "activation",
      "name" : "mobilenetv2_1.00_224_block_4_depthwise_relu__neg__",
      "beta" : 0
    },
    {
      "bottom" : "mobilenetv2_1.00_224_block_4_depthwise_relu_output_relu_neg",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "mobilenetv2_1.00_224_block_4_depthwise_relu__clip__",
      "top" : "mobilenetv2_1.00_224_block_4_depthwise_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "mobilenetv2_1.00_224_block_4_depthwise_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "mobilenetv2_1.00_224_block_4_depthwise_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "mobilenetv2_1.00_224_block_4_depthwise_relu_neg2",
      "top" : "mobilenetv2_1.00_224_block_4_depthwise_relu_output",
      "type" : "activation",
      "name" : "mobilenetv2_1.00_224_block_4_depthwise_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "mobilenetv2_1.00_224_block_4_project",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "mobilenetv2_1.00_224_block_4_project_BN_output",
      "blob_weights" : 59,
      "K" : 192,
      "blob_biases" : 57,
      "name" : "mobilenetv2_1.00_224_block_4_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "mobilenetv2_1.00_224_block_4_depthwise_relu_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "mobilenetv2_1.00_224_block_3_project_BN_output,mobilenetv2_1.00_224_block_4_project_BN_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "mobilenetv2_1.00_224_block_4_add",
      "top" : "mobilenetv2_1.00_224_block_4_add_output",
      "type" : "elementwise",
      "name" : "mobilenetv2_1.00_224_block_4_add",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "mobilenetv2_1.00_224_block_5_expand",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "mobilenetv2_1.00_224_block_5_expand_relu_output_relu",
      "blob_weights" : 63,
      "K" : 32,
      "blob_biases" : 61,
      "name" : "mobilenetv2_1.00_224_block_5_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "mobilenetv2_1.00_224_block_4_add_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "mobilenetv2_1.00_224_block_5_expand_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "mobilenetv2_1.00_224_block_5_expand_relu__neg__",
      "top" : "mobilenetv2_1.00_224_block_5_expand_relu_output_relu_neg",
      "type" : "activation",
      "name" : "mobilenetv2_1.00_224_block_5_expand_relu__neg__",
      "beta" : 0
    },
    {
      "bottom" : "mobilenetv2_1.00_224_block_5_expand_relu_output_relu_neg",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "mobilenetv2_1.00_224_block_5_expand_relu__clip__",
      "top" : "mobilenetv2_1.00_224_block_5_expand_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "mobilenetv2_1.00_224_block_5_expand_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "mobilenetv2_1.00_224_block_5_expand_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "mobilenetv2_1.00_224_block_5_expand_relu_neg2",
      "top" : "mobilenetv2_1.00_224_block_5_expand_relu_output",
      "type" : "activation",
      "name" : "mobilenetv2_1.00_224_block_5_expand_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "mobilenetv2_1.00_224_block_5_depthwise",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "mobilenetv2_1.00_224_block_5_depthwise_relu_output_relu",
      "blob_weights" : 67,
      "K" : 192,
      "blob_biases" : 65,
      "name" : "mobilenetv2_1.00_224_block_5_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 192,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "mobilenetv2_1.00_224_block_5_expand_relu_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "mobilenetv2_1.00_224_block_5_depthwise_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "mobilenetv2_1.00_224_block_5_depthwise_relu__neg__",
      "top" : "mobilenetv2_1.00_224_block_5_depthwise_relu_output_relu_neg",
      "type" : "activation",
      "name" : "mobilenetv2_1.00_224_block_5_depthwise_relu__neg__",
      "beta" : 0
    },
    {
      "bottom" : "mobilenetv2_1.00_224_block_5_depthwise_relu_output_relu_neg",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "mobilenetv2_1.00_224_block_5_depthwise_relu__clip__",
      "top" : "mobilenetv2_1.00_224_block_5_depthwise_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "mobilenetv2_1.00_224_block_5_depthwise_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "mobilenetv2_1.00_224_block_5_depthwise_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "mobilenetv2_1.00_224_block_5_depthwise_relu_neg2",
      "top" : "mobilenetv2_1.00_224_block_5_depthwise_relu_output",
      "type" : "activation",
      "name" : "mobilenetv2_1.00_224_block_5_depthwise_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "mobilenetv2_1.00_224_block_5_project",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "mobilenetv2_1.00_224_block_5_project_BN_output",
      "blob_weights" : 71,
      "K" : 192,
      "blob_biases" : 69,
      "name" : "mobilenetv2_1.00_224_block_5_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "mobilenetv2_1.00_224_block_5_depthwise_relu_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "mobilenetv2_1.00_224_block_4_add_output,mobilenetv2_1.00_224_block_5_project_BN_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "mobilenetv2_1.00_224_block_5_add",
      "top" : "mobilenetv2_1.00_224_block_5_add_output",
      "type" : "elementwise",
      "name" : "mobilenetv2_1.00_224_block_5_add",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "mobilenetv2_1.00_224_block_6_expand",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "mobilenetv2_1.00_224_block_6_expand_relu_output_relu",
      "blob_weights" : 75,
      "K" : 32,
      "blob_biases" : 73,
      "name" : "mobilenetv2_1.00_224_block_6_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "mobilenetv2_1.00_224_block_5_add_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "mobilenetv2_1.00_224_block_6_expand_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "mobilenetv2_1.00_224_block_6_expand_relu__neg__",
      "top" : "mobilenetv2_1.00_224_block_6_expand_relu_output_relu_neg",
      "type" : "activation",
      "name" : "mobilenetv2_1.00_224_block_6_expand_relu__neg__",
      "beta" : 0
    },
    {
      "bottom" : "mobilenetv2_1.00_224_block_6_expand_relu_output_relu_neg",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "mobilenetv2_1.00_224_block_6_expand_relu__clip__",
      "top" : "mobilenetv2_1.00_224_block_6_expand_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "mobilenetv2_1.00_224_block_6_expand_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "mobilenetv2_1.00_224_block_6_expand_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "mobilenetv2_1.00_224_block_6_expand_relu_neg2",
      "top" : "mobilenetv2_1.00_224_block_6_expand_relu_output",
      "type" : "activation",
      "name" : "mobilenetv2_1.00_224_block_6_expand_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "mobilenetv2_1.00_224_block_6_depthwise",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 0,
      "top" : "mobilenetv2_1.00_224_block_6_depthwise_relu_output_relu",
      "blob_weights" : 79,
      "K" : 192,
      "blob_biases" : 77,
      "stride_x" : 2,
      "name" : "mobilenetv2_1.00_224_block_6_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 192,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "mobilenetv2_1.00_224_block_6_expand_relu_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "mobilenetv2_1.00_224_block_6_depthwise_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "mobilenetv2_1.00_224_block_6_depthwise_relu__neg__",
      "top" : "mobilenetv2_1.00_224_block_6_depthwise_relu_output_relu_neg",
      "type" : "activation",
      "name" : "mobilenetv2_1.00_224_block_6_depthwise_relu__neg__",
      "beta" : 0
    },
    {
      "bottom" : "mobilenetv2_1.00_224_block_6_depthwise_relu_output_relu_neg",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "mobilenetv2_1.00_224_block_6_depthwise_relu__clip__",
      "top" : "mobilenetv2_1.00_224_block_6_depthwise_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "mobilenetv2_1.00_224_block_6_depthwise_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "mobilenetv2_1.00_224_block_6_depthwise_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "mobilenetv2_1.00_224_block_6_depthwise_relu_neg2",
      "top" : "mobilenetv2_1.00_224_block_6_depthwise_relu_output",
      "type" : "activation",
      "name" : "mobilenetv2_1.00_224_block_6_depthwise_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "mobilenetv2_1.00_224_block_6_project",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "mobilenetv2_1.00_224_block_6_project_BN_output",
      "blob_weights" : 83,
      "K" : 192,
      "blob_biases" : 81,
      "name" : "mobilenetv2_1.00_224_block_6_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "mobilenetv2_1.00_224_block_6_depthwise_relu_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "mobilenetv2_1.00_224_block_7_expand",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "mobilenetv2_1.00_224_block_7_expand_relu_output_relu",
      "blob_weights" : 87,
      "K" : 64,
      "blob_biases" : 85,
      "name" : "mobilenetv2_1.00_224_block_7_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 384,
      "bottom" : "mobilenetv2_1.00_224_block_6_project_BN_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "mobilenetv2_1.00_224_block_7_expand_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "mobilenetv2_1.00_224_block_7_expand_relu__neg__",
      "top" : "mobilenetv2_1.00_224_block_7_expand_relu_output_relu_neg",
      "type" : "activation",
      "name" : "mobilenetv2_1.00_224_block_7_expand_relu__neg__",
      "beta" : 0
    },
    {
      "bottom" : "mobilenetv2_1.00_224_block_7_expand_relu_output_relu_neg",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "mobilenetv2_1.00_224_block_7_expand_relu__clip__",
      "top" : "mobilenetv2_1.00_224_block_7_expand_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "mobilenetv2_1.00_224_block_7_expand_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "mobilenetv2_1.00_224_block_7_expand_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "mobilenetv2_1.00_224_block_7_expand_relu_neg2",
      "top" : "mobilenetv2_1.00_224_block_7_expand_relu_output",
      "type" : "activation",
      "name" : "mobilenetv2_1.00_224_block_7_expand_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "mobilenetv2_1.00_224_block_7_depthwise",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "mobilenetv2_1.00_224_block_7_depthwise_relu_output_relu",
      "blob_weights" : 91,
      "K" : 384,
      "blob_biases" : 89,
      "name" : "mobilenetv2_1.00_224_block_7_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 384,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 384,
      "bottom" : "mobilenetv2_1.00_224_block_7_expand_relu_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "mobilenetv2_1.00_224_block_7_depthwise_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "mobilenetv2_1.00_224_block_7_depthwise_relu__neg__",
      "top" : "mobilenetv2_1.00_224_block_7_depthwise_relu_output_relu_neg",
      "type" : "activation",
      "name" : "mobilenetv2_1.00_224_block_7_depthwise_relu__neg__",
      "beta" : 0
    },
    {
      "bottom" : "mobilenetv2_1.00_224_block_7_depthwise_relu_output_relu_neg",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "mobilenetv2_1.00_224_block_7_depthwise_relu__clip__",
      "top" : "mobilenetv2_1.00_224_block_7_depthwise_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "mobilenetv2_1.00_224_block_7_depthwise_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "mobilenetv2_1.00_224_block_7_depthwise_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "mobilenetv2_1.00_224_block_7_depthwise_relu_neg2",
      "top" : "mobilenetv2_1.00_224_block_7_depthwise_relu_output",
      "type" : "activation",
      "name" : "mobilenetv2_1.00_224_block_7_depthwise_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "mobilenetv2_1.00_224_block_7_project",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "mobilenetv2_1.00_224_block_7_project_BN_output",
      "blob_weights" : 95,
      "K" : 384,
      "blob_biases" : 93,
      "name" : "mobilenetv2_1.00_224_block_7_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "mobilenetv2_1.00_224_block_7_depthwise_relu_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "mobilenetv2_1.00_224_block_6_project_BN_output,mobilenetv2_1.00_224_block_7_project_BN_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "mobilenetv2_1.00_224_block_7_add",
      "top" : "mobilenetv2_1.00_224_block_7_add_output",
      "type" : "elementwise",
      "name" : "mobilenetv2_1.00_224_block_7_add",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "mobilenetv2_1.00_224_block_8_expand",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "mobilenetv2_1.00_224_block_8_expand_relu_output_relu",
      "blob_weights" : 99,
      "K" : 64,
      "blob_biases" : 97,
      "name" : "mobilenetv2_1.00_224_block_8_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 384,
      "bottom" : "mobilenetv2_1.00_224_block_7_add_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "mobilenetv2_1.00_224_block_8_expand_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "mobilenetv2_1.00_224_block_8_expand_relu__neg__",
      "top" : "mobilenetv2_1.00_224_block_8_expand_relu_output_relu_neg",
      "type" : "activation",
      "name" : "mobilenetv2_1.00_224_block_8_expand_relu__neg__",
      "beta" : 0
    },
    {
      "bottom" : "mobilenetv2_1.00_224_block_8_expand_relu_output_relu_neg",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "mobilenetv2_1.00_224_block_8_expand_relu__clip__",
      "top" : "mobilenetv2_1.00_224_block_8_expand_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "mobilenetv2_1.00_224_block_8_expand_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "mobilenetv2_1.00_224_block_8_expand_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "mobilenetv2_1.00_224_block_8_expand_relu_neg2",
      "top" : "mobilenetv2_1.00_224_block_8_expand_relu_output",
      "type" : "activation",
      "name" : "mobilenetv2_1.00_224_block_8_expand_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "mobilenetv2_1.00_224_block_8_depthwise",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "mobilenetv2_1.00_224_block_8_depthwise_relu_output_relu",
      "blob_weights" : 103,
      "K" : 384,
      "blob_biases" : 101,
      "name" : "mobilenetv2_1.00_224_block_8_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 384,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 384,
      "bottom" : "mobilenetv2_1.00_224_block_8_expand_relu_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "mobilenetv2_1.00_224_block_8_depthwise_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "mobilenetv2_1.00_224_block_8_depthwise_relu__neg__",
      "top" : "mobilenetv2_1.00_224_block_8_depthwise_relu_output_relu_neg",
      "type" : "activation",
      "name" : "mobilenetv2_1.00_224_block_8_depthwise_relu__neg__",
      "beta" : 0
    },
    {
      "bottom" : "mobilenetv2_1.00_224_block_8_depthwise_relu_output_relu_neg",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "mobilenetv2_1.00_224_block_8_depthwise_relu__clip__",
      "top" : "mobilenetv2_1.00_224_block_8_depthwise_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "mobilenetv2_1.00_224_block_8_depthwise_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "mobilenetv2_1.00_224_block_8_depthwise_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "mobilenetv2_1.00_224_block_8_depthwise_relu_neg2",
      "top" : "mobilenetv2_1.00_224_block_8_depthwise_relu_output",
      "type" : "activation",
      "name" : "mobilenetv2_1.00_224_block_8_depthwise_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "mobilenetv2_1.00_224_block_8_project",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "mobilenetv2_1.00_224_block_8_project_BN_output",
      "blob_weights" : 107,
      "K" : 384,
      "blob_biases" : 105,
      "name" : "mobilenetv2_1.00_224_block_8_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "mobilenetv2_1.00_224_block_8_depthwise_relu_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "mobilenetv2_1.00_224_block_7_add_output,mobilenetv2_1.00_224_block_8_project_BN_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "mobilenetv2_1.00_224_block_8_add",
      "top" : "mobilenetv2_1.00_224_block_8_add_output",
      "type" : "elementwise",
      "name" : "mobilenetv2_1.00_224_block_8_add",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "mobilenetv2_1.00_224_block_9_expand",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "mobilenetv2_1.00_224_block_9_expand_relu_output_relu",
      "blob_weights" : 111,
      "K" : 64,
      "blob_biases" : 109,
      "name" : "mobilenetv2_1.00_224_block_9_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 384,
      "bottom" : "mobilenetv2_1.00_224_block_8_add_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "mobilenetv2_1.00_224_block_9_expand_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "mobilenetv2_1.00_224_block_9_expand_relu__neg__",
      "top" : "mobilenetv2_1.00_224_block_9_expand_relu_output_relu_neg",
      "type" : "activation",
      "name" : "mobilenetv2_1.00_224_block_9_expand_relu__neg__",
      "beta" : 0
    },
    {
      "bottom" : "mobilenetv2_1.00_224_block_9_expand_relu_output_relu_neg",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "mobilenetv2_1.00_224_block_9_expand_relu__clip__",
      "top" : "mobilenetv2_1.00_224_block_9_expand_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "mobilenetv2_1.00_224_block_9_expand_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "mobilenetv2_1.00_224_block_9_expand_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "mobilenetv2_1.00_224_block_9_expand_relu_neg2",
      "top" : "mobilenetv2_1.00_224_block_9_expand_relu_output",
      "type" : "activation",
      "name" : "mobilenetv2_1.00_224_block_9_expand_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "mobilenetv2_1.00_224_block_9_depthwise",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "mobilenetv2_1.00_224_block_9_depthwise_relu_output_relu",
      "blob_weights" : 115,
      "K" : 384,
      "blob_biases" : 113,
      "name" : "mobilenetv2_1.00_224_block_9_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 384,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 384,
      "bottom" : "mobilenetv2_1.00_224_block_9_expand_relu_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "mobilenetv2_1.00_224_block_9_depthwise_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "mobilenetv2_1.00_224_block_9_depthwise_relu__neg__",
      "top" : "mobilenetv2_1.00_224_block_9_depthwise_relu_output_relu_neg",
      "type" : "activation",
      "name" : "mobilenetv2_1.00_224_block_9_depthwise_relu__neg__",
      "beta" : 0
    },
    {
      "bottom" : "mobilenetv2_1.00_224_block_9_depthwise_relu_output_relu_neg",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "mobilenetv2_1.00_224_block_9_depthwise_relu__clip__",
      "top" : "mobilenetv2_1.00_224_block_9_depthwise_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "mobilenetv2_1.00_224_block_9_depthwise_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "mobilenetv2_1.00_224_block_9_depthwise_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "mobilenetv2_1.00_224_block_9_depthwise_relu_neg2",
      "top" : "mobilenetv2_1.00_224_block_9_depthwise_relu_output",
      "type" : "activation",
      "name" : "mobilenetv2_1.00_224_block_9_depthwise_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "mobilenetv2_1.00_224_block_9_project",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "mobilenetv2_1.00_224_block_9_project_BN_output",
      "blob_weights" : 119,
